# 83 метри долг е 378 метри и има две патеки широки по 3,50 метри
# 250 метри односно од 328 до 820 стапки
# 160 км на час
# 3,000 милји од мајами флорида беше придружена од ветрови со 40 mph 64 kph

# PERCENT
# 3 %
# 32 проценти

# DISTANCE
# 5 мм
# 6,34 инчи
# 1040 км
# 12,8 km
# 6387 км
# 491 милји
# 645 милји
# 8 милји

# AREA
# 300,948 sq mi
# 3.850 км²
# 3136 мм2

# WEIGHT
# 16 килограми
# 90 килограми

# 1 унца
# 17 фунти
# 36 фунти
# 200 фунти
# 1000 фунти

# SPEED
# 83 km/h
# 160 км/ч
# 240 километри на час
# 17.500 милји на час
# 1,5 километри во секунда
# 149 милји на час
# 100-200 милји/час
# 17.500 милји на час
# 3000 милји на час
# 8 милји во секунда

# 10 години
