import pytest

from normalization.date import dates2words, day_month2words, deordinalize_day_months


@pytest.mark.parametrize(
    "input,expected",
    [
        ("1-ви јануари", "1 јануари"),
        ("2-ви август", "2 август"),
        ("6-ти јули", "6 јули"),
        ("9-ти јули", "9 јули"),
        ("10-ти јуни 1940 год", "10 јуни 1940 год"),
        ("11-ти септември 2001.", "11 септември 2001."),
        ("17-ти септември 2007", "17 септември 2007"),
        ("21-ви јули 356 г", "21 јули 356 г"),
        ("26-ти септември.", "26 септември."),
        ("27-ми август", "27 август"),
    ],
)
def test_deordinalize_day_months(input, expected):
    assert deordinalize_day_months(input) == expected


@pytest.mark.parametrize(
    "input,expected",
    [
        ("1 јануари", "први јануари"),
        ("4 јули", "четврти јули"),
        ("5 август", "петти август"),
        ("16 ноември", "шеснаесетти ноември"),
    ],
)
def test_day_month2words(input, expected):
    assert day_month2words(input) == expected


@pytest.mark.parametrize(
    "input,expected",
    [
        ("1922 г", "илјада деветстотини дваесет и втора година"),
        ("1976 г.", "илјада деветстотини седумдесет и шестта година"),
        ("1973 год", "илјада деветстотини седумдесет и трета година"),
        ("1992 година", "илјада деветстотини деведесет и втора година"),
        ("4 јули 1776", "четврти јули илјада седумстотини седумдесет и шестта"),
        (
            "17 септември 1939",
            "седумнаесетти септември илјада деветстотини триесет и деветта",
        ),
        (
            "26 ноември 2008 г",
            "дваесет и шестти ноември две илјади и осма година",
        ),
        (
            "6 октомври 1789 г.",
            "шестти октомври илјада седумстотини осумдесет и деветта година",
        ),
        (
            "18 март 1965 г.",
            "осумнаесетти март илјада деветстотини шеесет и петта година",
        ),
        (
            "24 септември 1759 год",
            "дваесет и четврти септември илјада седумстотини педесет и деветта година",
        ),
        (
            "17 септември 1939 година",
            "седумнаесетти септември илјада деветстотини триесет и деветта година",
        ),
    ],
)
def test_dates2words(input, expected):
    assert dates2words(input) == expected
