import pytest

from normalization.ordinals import ordinal2words


@pytest.mark.parametrize(
    "input,expected",
    [
        ("11-ти", "единаесетти"),
        ("17-ти", "седумнаесетти"),
        ("15-тиот", "петнаесеттиот"),
        ("19-тиот", "деветнаесеттиот"),
        ("7-миот", "седмиот"),
        ("9-тиот", "деветтиот"),
        ("1-ва", "прва"),
        ("3-та", "трета"),
        ("37-ма", "триесет и седма"),
        ("24-тата", "дваесет и четвртата"),
        ("2-ро", "второ"),
        ("33-то", "триесет и трето"),
        ("1-вото", "првото"),
        ("7-мово", "седмово"),
        ("1-ви", "први"),
        ("27-ми", "дваесет и седми"),
        ("1830-тите", "илјада осумстотини и триесеттите"),
    ],
)
def test_ordinal2words(input, expected):
    assert ordinal2words(input) == expected
